# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = int(input("Введите число: "))
summa = 0
if a < 100 or a > 999:
    print("Число не трехзначное")
else:
    while a > 0:
        summa += a % 10
        a //= 10
    print(f"Сумма цифр: {summa}")
